In [1]:
import numpy as np
import pandas as pd

# Ob 1 : Series

In [2]:
data = [0.25 , 0.5, 0.75, 1]
data = pd.Series(data)

In [3]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
data[2]

0.75

In [9]:
data = pd.Series([0.25 , 0.5, 0.75, 1], index=['a','b','c','d'])

In [10]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [11]:
data['a'] # indeks eksplisit

0.25

In [12]:
data[3] # indeks implisit

1.0

In [13]:
data = pd.Series([0.25 , 0.5, 0.75, 1], index=[2,5,3,7])

In [14]:
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [15]:
data[2]

0.25

In [16]:
data[0]

KeyError: 0

In [17]:
data = pd.Series([0.25 , 0.5, 0.75, 1], index=['a','b','c','d'])

In [18]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [19]:
data['b':'c']

b    0.50
c    0.75
dtype: float64

In [20]:
data[1:2]

b    0.5
dtype: float64

## loc, iloc

In [22]:
data = pd.Series([0.25 , 0.5, 0.75, 1], index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [23]:
data[2] # indeks eksplisit : selecting

0.25

In [24]:
data[2:3] # indeks implisit : slicing

3    0.75
dtype: float64

In [26]:
# loc
data.loc[3]

0.75

In [27]:
data.loc[2:3]

2    0.25
5    0.50
3    0.75
dtype: float64

In [28]:
# iloc
data.iloc[3]

1.0

In [29]:
data.iloc[2:3]

3    0.75
dtype: float64

In [30]:
dict_populasi = {'Jakarta': 7500000,
                 'Bogor': 4900000,
                 'Depok': 3500000,
                 'Tangerang': 2700000,
                 'Bekasi': 6700000}

In [32]:
populasi = pd.Series(dict_populasi)
populasi

Jakarta      7500000
Bogor        4900000
Depok        3500000
Tangerang    2700000
Bekasi       6700000
dtype: int64

In [33]:
dict_luas = {'Jakarta': 73727344,
             'Bogor': 32584521,
             'Depok': 24785245,
             'Tangerang': 30251845,
             'Bekasi': 35547888}
luas = pd.Series(dict_luas)
luas

Jakarta      73727344
Bogor        32584521
Depok        24785245
Tangerang    30251845
Bekasi       35547888
dtype: int64

In [48]:
daerah = pd.DataFrame({'populasi':populasi, 'luas':luas})

In [36]:
daerah

               pop      luas
Jakarta    7500000  73727344
Bogor      4900000  32584521
Depok      3500000  24785245
Tangerang  2700000  30251845
Bekasi     6700000  35547888

In [39]:
daerah['luas']

Jakarta      73727344
Bogor        32584521
Depok        24785245
Tangerang    30251845
Bekasi       35547888
Name: luas, dtype: int64

In [40]:
daerah.luas

Jakarta      73727344
Bogor        32584521
Depok        24785245
Tangerang    30251845
Bekasi       35547888
Name: luas, dtype: int64

In [41]:
daerah.pop

<bound method NDFrame.pop of                pop      luas
Jakarta    7500000  73727344
Bogor      4900000  32584521
Depok      3500000  24785245
Tangerang  2700000  30251845
Bekasi     6700000  35547888>

In [51]:
df = pd.read_csv("data/Titanic.csv")

In [52]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [57]:
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [58]:
df[1:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
sel_columns = ["Survived", "Name", "Age"]
df[sel_columns]

     Survived                                               Name   Age
0           0                            Braund, Mr. Owen Harris  22.0
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2           1                             Heikkinen, Miss. Laina  26.0
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4           0                           Allen, Mr. William Henry  35.0
..        ...                                                ...   ...
886         0                              Montvila, Rev. Juozas  27.0
887         1                       Graham, Miss. Margaret Edith  19.0
888         0           Johnston, Miss. Catherine Helen "Carrie"   NaN
889         1                              Behr, Mr. Karl Howell  26.0
890         0                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

In [64]:
df[df['Survived'] == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [67]:
df[~(df['Age'] > 50)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [66]:
df['Age'] > 60

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [73]:
df[["Survived", "Pclass"]][(df['Age'] > 50) & (df['Sex'] == 'male')]

     Survived  Pclass
6           0       1
33          0       2
54          0       1
94          0       3
96          0       1
116         0       3
124         0       1
150         0       2
152         0       3
155         0       1
170         0       1
174         0       1
222         0       3
232         0       2
249         0       2
252         0       1
262         0       1
280         0       3
317         0       2
326         0       3
406         0       3
438         0       1
449         1       1
456         0       1
467         0       1
487         0       1
492         0       1
493         0       1
545         0       1
555         0       1
570         1       2
582         0       2
587         1       1
625         0       1
626         0       2
630         1       1
631         0       3
647         1       1
659         0       1
672         0       2
684         0       2
694         0       1
695         0       2
714         0       2
745         0       1
851         0       3
857         1       1

In [75]:
daerah

           populasi      luas
Jakarta     7500000  73727344
Bogor       4900000  32584521
Depok       3500000  24785245
Tangerang   2700000  30251845
Bekasi      6700000  35547888

In [76]:
daerah['pop_per_area'] = daerah['populasi'] / daerah['luas']

In [78]:
daerah['jum_alay'] = 1

In [79]:
daerah

           populasi      luas  pop_per_area  jum_alay
Jakarta     7500000  73727344      0.101726         1
Bogor       4900000  32584521      0.150378         1
Depok       3500000  24785245      0.141213         1
Tangerang   2700000  30251845      0.089251         1
Bekasi      6700000  35547888      0.188478         1

In [82]:
daerah_tambahan = pd.DataFrame({'Bandung':[15181616,1484646,0.18000,5]})

In [85]:
daerah_tambahan = daerah_tambahan.T
daerah_tambahan.columns = daerah.columns

In [86]:
daerah_tambahan

           populasi       luas  pop_per_area  jum_alay
Bandung  15181616.0  1484646.0          0.18       5.0

In [87]:
pd.concat([daerah, daerah_tambahan])

             populasi        luas  pop_per_area  jum_alay
Jakarta     7500000.0  73727344.0      0.101726       1.0
Bogor       4900000.0  32584521.0      0.150378       1.0
Depok       3500000.0  24785245.0      0.141213       1.0
Tangerang   2700000.0  30251845.0      0.089251       1.0
Bekasi      6700000.0  35547888.0      0.188478       1.0
Bandung    15181616.0   1484646.0      0.180000       5.0

In [92]:
daerah.drop('jum_alay', axis=1, inplace=True)

KeyError: "['jum_alay'] not found in axis"

In [91]:
daerah

           populasi      luas  pop_per_area
Jakarta     7500000  73727344      0.101726
Bogor       4900000  32584521      0.150378
Depok       3500000  24785245      0.141213
Tangerang   2700000  30251845      0.089251
Bekasi      6700000  35547888      0.188478

In [94]:
daerah.drop('Jakarta')

           populasi      luas  pop_per_area
Bogor       4900000  32584521      0.150378
Depok       3500000  24785245      0.141213
Tangerang   2700000  30251845      0.089251
Bekasi      6700000  35547888      0.188478

In [98]:
daerah.columns = ['populasi', 'luas_m2', 'pop_per_area']

In [99]:
daerah

           populasi   luas_m2  pop_per_area
Jakarta     7500000  73727344      0.101726
Bogor       4900000  32584521      0.150378
Depok       3500000  24785245      0.141213
Tangerang   2700000  30251845      0.089251
Bekasi      6700000  35547888      0.188478

In [102]:
daerah.rename(columns={'populasi': 'pop', 'luas_m2':'luas'},inplace=True)

In [106]:
daerah

               pop      luas  pop_per_area
Jakarta    7500000  73727344      0.101726
Bogor      4900000  32584521      0.150378
Depok      3500000  24785245      0.141213
Tangerang  2700000  30251845      0.089251
Bekasi     6700000  35547888      0.188478

In [104]:
daerah.rename(columns=str.upper)

               POP      LUAS  POP_PER_AREA
Jakarta    7500000  73727344      0.101726
Bogor      4900000  32584521      0.150378
Depok      3500000  24785245      0.141213
Tangerang  2700000  30251845      0.089251
Bekasi     6700000  35547888      0.188478

In [109]:
daerah.sort_values('luas', ascending=False)

               pop      luas  pop_per_area
Jakarta    7500000  73727344      0.101726
Bekasi     6700000  35547888      0.188478
Bogor      4900000  32584521      0.150378
Tangerang  2700000  30251845      0.089251
Depok      3500000  24785245      0.141213

In [113]:
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [114]:
df.shape

(891, 12)

In [115]:
daerah.columns

Index(['pop', 'luas', 'pop_per_area'], dtype='object')

In [116]:
daerah.index

Index(['Jakarta', 'Bogor', 'Depok', 'Tangerang', 'Bekasi'], dtype='object')

In [117]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [122]:
df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [125]:
df[df.Age.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [131]:
df_slice = df[['Survived','Sex', 'PassengerId']]
slice_pivot = df_slice.pivot_table(index=['Survived'], columns=['Sex'], \
                                       aggfunc=np.size,fill_value=0)

In [132]:
slice_pivot

         PassengerId
Sex           female male
Survived
0                 81  468
1                233  109

In [130]:
pd.crosstab(df.Survived, df.Sex)

Sex       female  male
Survived
0             81   468
1            233   109

In [136]:
df_slice = df[['Survived', 'Sex']]
pd.get_dummies(df_slice,'Sex')

     Survived  Sex_female  Sex_male
0           0           0         1
1           1           1         0
2           1           1         0
3           1           1         0
4           0           0         1
..        ...         ...       ...
886         0           0         1
887         1           1         0
888         0           1         0
889         1           0         1
890         0           0         1

[891 rows x 3 columns]

In [140]:
df_slice.groupby('Sex').mean()

        Survived
Sex
female  0.742038
male    0.188908

Anda adalah seorang dosen di kelas dasar pemrograman
Ada 3 nilai berikut : 
np.random.normal(mean, var, n)
- tugas ~ N(85, 7)
- uts ~ N(60, 15)
- uas ~ N(75, 10)

buat kolom baru (nilai akhir) yang dihitung dengan formula :
tugas : 20%
UTS : 40%
UAS : 40%

buat kolom baru dan lakukan binning dengan kriteria berikut:
A ~ 85-100
A- ~ 80-85
B+ ~ 75-80
B ~ 70-75
B- ~ 65-70
C+ ~ 60-65
C ~ 55-60
C- ~ 50-55
D ~ 20-50
E ~ 0-20

In [141]:
tugas = np.random.normal(85, 7, 40)
uts = np.random.normal(60, 15, 40)
uas = np.random.normal(75, 10, 40)

In [142]:
df_nilai = pd.DataFrame({'tugas':tugas,
                         'uts':uts,
                         'uas':uas})

In [144]:
df_nilai['nilai_akhir'] = 0.2*df_nilai['tugas'] + 0.4*df_nilai['uts'] + 0.4*df_nilai['uas']

In [149]:
bins = [0,20,50,55,60,65,70,75,80,85,100]
labels = ['E', 'D', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A']
df_nilai['nilai_huruf'] = pd.cut(df_nilai['nilai_akhir'], bins, labels=labels)

In [151]:
df_nilai[df_nilai['nilai_huruf'] == 'A']

        tugas        uts        uas  nilai_akhir nilai_huruf
33  82.377896  79.922757  95.643452    86.702063           A
36  91.481292  86.080875  82.803694    85.850086           A